In [41]:
from pandas import DataFrame, Series
import pandas as pd

In [8]:
marks = {
    'Name': ['mehul', 'jane', 'jill'],
    'Roll': [10, 12, 8],
    'Physics': [99, 89, 90],
    'Chemistry': [100, 93, 99]
}

In [9]:
d1 = DataFrame(marks)
d1

    Name  Roll  Physics  Chemistry
0  mehul    10       99        100
1   jane    12       89         93
2   jill     8       90         99

In [23]:
d2 = DataFrame(marks, index=marks['Roll'], columns=['Name', 'Physics', 'Chemistry'])
d2

     Name  Physics  Chemistry
10  mehul       99        100
12   jane       89         93
8    jill       90         99

In [15]:
print(d2.index)
print(d2.columns)
print(d2.dtypes)
print(d2.values)

Int64Index([10, 12, 8], dtype='int64')
Index(['Name', 'Physics', 'Chemistry'], dtype='object')
Name         object
Physics       int64
Chemistry     int64
dtype: object
[['mehul' 99 100]
 ['jane' 89 93]
 ['jill' 90 99]]

In [20]:
print(d2)
# indexing
# implicit 0 based row + columns index
print(d2.iloc[0])
print(d2.iloc[[0, -1]])

print(d2.iloc[[0, -1], 0])
print(d2.iloc[[-1, -2], [0, -1]])

     Name  Physics  Chemistry
10  mehul       99        100
12   jane       89         93
8    jill       90         99
Name         mehul
Physics         99
Chemistry      100
Name: 10, dtype: object
     Name  Physics  Chemistry
10  mehul       99        100
8    jill       90         99
10    mehul
8      jill
Name: Name, dtype: object
    Name  Chemistry
8   jill         99
12  jane         93

In [25]:
# explicit row + columns indexes
print(d2.loc[[10, 8]])
print(d2.loc[[12, 8], ['Name', 'Chemistry']])

     Name  Physics  Chemistry
10  mehul       99        100
8    jill       90         99
    Name  Chemistry
12  jane         93
8   jill         99

In [28]:
# slicing
# implicit 0 based row + column slicing
print(d2)
print(d2.iloc[-2:])
print(d2.iloc[:2, -2:])

     Name  Physics  Chemistry
10  mehul       99        100
12   jane       89         93
8    jill       90         99
    Name  Physics  Chemistry
12  jane       89         93
8   jill       90         99
    Physics  Chemistry
10       99        100
12       89         93

In [33]:
# column indexing
print(d2)
print(d2['Physics'])
print(d2[['Physics', 'Chemistry']])

     Name  Physics  Chemistry
10  mehul       99        100
12   jane       89         93
8    jill       90         99
10    99
12    89
8     90
Name: Physics, dtype: int64
    Physics  Chemistry
10       99        100
12       89         93
8        90         99

In [30]:
s1 = Series({
    12: 100,
    8: 98,
    10: 90
})
print(s1)

12    100
8      98
10     90
dtype: int64

In [34]:
d2['Maths'] = s1
print(d2)

     Name  Physics  Chemistry  Maths
10  mehul       99        100     90
12   jane       89         93    100
8    jill       90         99     98

In [35]:
d2['Total'] = d2['Physics'] + d2['Chemistry'] + d2['Maths']
d2

     Name  Physics  Chemistry  Maths  Total
10  mehul       99        100     90    289
12   jane       89         93    100    282
8    jill       90         99     98    287

In [36]:
d3 = d2[['Physics', 'Chemistry', 'Maths']]
d3

    Physics  Chemistry  Maths
10       99        100     90
12       89         93    100
8        90         99     98

In [38]:
print(d3.mean(axis=0))
print(d3.sum(axis=1))

Physics      92.666667
Chemistry    97.333333
Maths        96.000000
dtype: float64
10    289
12    282
8     287
dtype: int64

In [39]:
gre = DataFrame({
    'Verbal': [100, 98, 89],
    'Quant': [98, 100, 78]
}, index=[12, 10, 8])
gre

    Verbal  Quant
12     100     98
10      98    100
8       89     78

In [40]:
d2

     Name  Physics  Chemistry  Maths  Total
10  mehul       99        100     90    289
12   jane       89         93    100    282
8    jill       90         99     98    287

In [43]:
data = pd.merge(d2, gre, left_index=True, right_index=True)
data

     Name  Physics  Chemistry  Maths  Total  Verbal  Quant
10  mehul       99        100     90    289      98    100
12   jane       89         93    100    282     100     98
8    jill       90         99     98    287      89     78